20220531151955-git_lfs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git-LFS</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Git-LFS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7fb5fb9">objects</a>
<ul>
<li><a href="#org9bbcdc8">Object Data</a>
<ul>
<li><a href="#org80be075">tranining and inference</a></li>
<li><a href="#orgf9ac150">integration test</a></li>
</ul>
</li>
<li><a href="#org56d7d54">Auxiliary Data</a>
<ul>
<li><a href="#org9e2cc6a">documents, Images, Videos</a></li>
</ul>
</li>
<li><a href="#orgfc121d0">Build Artifacts (artifactory!)</a>
<ul>
<li><a href="#orgb52832f">checkpoints</a></li>
<li><a href="#org802d526">model files</a></li>
<li><a href="#org97c7799">logging files</a></li>
</ul>
</li>
<li><a href="#org7e3a647">not size dependent, （binary)</a>
<ul>
<li><a href="#org212239a">changes leads to size grow for version control</a></li>
<li><a href="#org47d42f3">&lt;500kB is ok</a></li>
</ul>
</li>
<li><a href="#orga4572c5">Set up git LFS on dev machines enterprise config</a></li>
<li><a href="#org82dfe33">configure file size limit on git server!</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       aa5848aa-9f07-444d-8a0c-8898e5c6eab3
</p>

<div id="outline-container-org7fb5fb9" class="outline-2">
<h2 id="org7fb5fb9">objects</h2>
<div class="outline-text-2" id="text-org7fb5fb9">
</div>
<div id="outline-container-org9bbcdc8" class="outline-3">
<h3 id="org9bbcdc8">Object Data</h3>
<div class="outline-text-3" id="text-org9bbcdc8">
</div>
<div id="outline-container-org80be075" class="outline-4">
<h4 id="org80be075">tranining and inference</h4>
</div>
<div id="outline-container-orgf9ac150" class="outline-4">
<h4 id="orgf9ac150">integration test</h4>
</div>
</div>
<div id="outline-container-org56d7d54" class="outline-3">
<h3 id="org56d7d54">Auxiliary Data</h3>
<div class="outline-text-3" id="text-org56d7d54">
</div>
<div id="outline-container-org9e2cc6a" class="outline-4">
<h4 id="org9e2cc6a">documents, Images, Videos</h4>
</div>
</div>
<div id="outline-container-orgfc121d0" class="outline-3">
<h3 id="orgfc121d0">Build Artifacts (artifactory!)</h3>
<div class="outline-text-3" id="text-orgfc121d0">
</div>
<div id="outline-container-orgb52832f" class="outline-4">
<h4 id="orgb52832f">checkpoints</h4>
</div>
<div id="outline-container-org802d526" class="outline-4">
<h4 id="org802d526">model files</h4>
</div>
<div id="outline-container-org97c7799" class="outline-4">
<h4 id="org97c7799">logging files</h4>
</div>
</div>
<div id="outline-container-org7e3a647" class="outline-3">
<h3 id="org7e3a647">not size dependent, （binary)</h3>
<div class="outline-text-3" id="text-org7e3a647">
</div>
<div id="outline-container-org212239a" class="outline-4">
<h4 id="org212239a">changes leads to size grow for version control</h4>
<div class="outline-text-4" id="text-org212239a">
</div>
<ul class="org-ul">
<li><a id="org7e7c69b"></a>difficult to compress and change frequently<br /></li>
</ul>
</div>
<div id="outline-container-org47d42f3" class="outline-4">
<h4 id="org47d42f3">&lt;500kB is ok</h4>
</div>
</div>
<div id="outline-container-orga4572c5" class="outline-3">
<h3 id="orga4572c5">Set up git LFS on dev machines enterprise config</h3>
</div>
<div id="outline-container-org82dfe33" class="outline-3">
<h3 id="org82dfe33">configure file size limit on git server!</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
